In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [3]:
df = pd.read_csv('Salary_Data.csv')
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [4]:
df.value_counts()

YearsExperience  Salary
1.1              39343.0     1
1.3              46205.0     1
10.3             122391.0    1
9.6              112635.0    1
9.5              116969.0    1
9.0              105582.0    1
8.7              109431.0    1
8.2              113812.0    1
7.9              101302.0    1
7.1              98273.0     1
6.8              91738.0     1
6.0              93940.0     1
5.9              81363.0     1
5.3              83088.0     1
5.1              66029.0     1
4.9              67938.0     1
4.5              61111.0     1
4.1              57081.0     1
4.0              56957.0     1
                 55794.0     1
3.9              63218.0     1
3.7              57189.0     1
3.2              64445.0     1
                 54445.0     1
3.0              60150.0     1
2.9              56642.0     1
2.2              39891.0     1
2.0              43525.0     1
1.5              37731.0     1
10.5             121872.0    1
dtype: int64

In [5]:
df.describe()

       YearsExperience         Salary
count        30.000000      30.000000
mean          5.313333   76003.000000
std           2.837888   27414.429785
min           1.100000   37731.000000
25%           3.200000   56720.750000
50%           4.700000   65237.000000
75%           7.700000  100544.750000
max          10.500000  122391.000000

In [6]:
x = df[['YearsExperience']]

In [7]:
y = df[['Salary']]

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size=0.3)

In [10]:
x_train

    YearsExperience
23              8.2
5               2.9
4               2.2
16              5.1
17              5.3
22              7.9
25              9.0
14              4.5
10              3.9
19              6.0
20              6.8
11              4.0
3               2.0
12              4.0
29             10.5
26              9.5
6               3.0
7               3.2
24              8.7
13              4.1
9               3.7

In [11]:
x_test

    YearsExperience
8               3.2
28             10.3
27              9.6
18              5.9
0               1.1
1               1.3
21              7.1
2               1.5
15              4.9

In [12]:
y_train

      Salary
23  113812.0
5    56642.0
4    39891.0
16   66029.0
17   83088.0
22  101302.0
25  105582.0
14   61111.0
10   63218.0
19   93940.0
20   91738.0
11   55794.0
3    43525.0
12   56957.0
29  121872.0
26  116969.0
6    60150.0
7    54445.0
24  109431.0
13   57081.0
9    57189.0

In [13]:
y_test

      Salary
8    64445.0
28  122391.0
27  112635.0
18   81363.0
0    39343.0
1    46205.0
21   98273.0
2    37731.0
15   67938.0

In [14]:
from sklearn.linear_model import LinearRegression

In [15]:
df = LinearRegression()

In [16]:
df.fit(x_train,y_train)

LinearRegression()

In [19]:
y_pred = df.predict(x_test)

In [18]:
df.predict(y_test)

C:\Users\Amol\anaconda3\lib\site-packages\sklearn\base.py:493: FutureWarning: The feature names should match those that were passed during fit. Starting version 1.2, an error will be raised.
Feature names unseen at fit time:
- Salary
Feature names seen at fit time, yet now missing:
- YearsExperience

  warnings.warn(message, FutureWarning)

array([[6.41000063e+08],
       [1.21733787e+09],
       [1.12030354e+09],
       [8.09268503e+08],
       [3.91332584e+08],
       [4.59582853e+08],
       [9.77457375e+08],
       [3.75299440e+08],
       [6.75741856e+08]])

In [20]:
y_test.head()

      Salary
8    64445.0
28  122391.0
27  112635.0
18   81363.0
0    39343.0

In [21]:
y_pred[0:5]

array([[ 54253.07488625],
       [124870.51958943],
       [117908.23630883],
       [ 81107.5961114 ],
       [ 33366.22504446]])

In [23]:
from sklearn.metrics import mean_squared_error

In [24]:
mean_squared_error(y_test,y_pred)

36580422.17098087